// 비동기 작업의 실행 흐름

// JS = 싱글 스레드, but 비동기 가능한 이유?
// Web APIs가 비동기 작업 처리
// 이벤트 루프가 비동기 작업의 실행 순서 관리

// 출력: A, D, C, B

console.log('A'); // 1. 콜 스택에서 실행

// 2-1. 콜 스택에서 실행 → Web API에 타이머 처리 요청 → 스택에서 제거
// 2-2. 타이머 완료 후 콜백을 매크로태스크 큐에 넣음
// 6. 이벤트 루프가 콜 스택이 비었을 때 콜백을 옮겨 실행
setTimeout(() => {
  console.log('B');
}, 0);

// 3-1. 콜 스택에서 실행 → fulfilled 상태의 프로미스 객체 반환 → 스택에서 제거
// 3-2. then 호출 → 콜 스택에서 실행 → fulfilled 상태이므로 바로 콜백을 마이크로태스크 큐에 넣음 → 스택에서 제거
// 5. 이벤트 루프가 콜 스택이 비는 즉시 콜백을 옮겨 실행 (마이크로태스크 우선 처리)
Promise.resolve().then(() => {
  console.log('C');
});

console.log('D'); // 4. 콜 스택에서 실행
