// 마이크로태스크는 항상 먼저 실행된다
// 마이크로태스크는 큐가 빌 때까지 실행된다

// 마이크로태스크 = 이번 턴 안에서 마무리할 일 / 지금 실행 중인 작업의 연장선
// 매크로태스크 = 완전히 다음 턴의 새로운 작업

// 출력: A, E, C, D, B

console.log('A'); // 1. 콜 스택에서 실행

// 2-1. Web API에 타이머 처리 요청
// 2-2. 타이머 완료 후 콜백을 매크로태스크 큐에 넣음
// 6. 이벤트 루프가 콜 스택이 비었을 때 콜백을 옮겨 실행
// (순회마다 한 개의 태스크 실행)
setTimeout(() => {
  console.log('B');
}, 0);

// 3-1. fulfilled 상태의 프로미스 객체(P1) 반환
// 3-2. 첫 번째 콜백을 마이크로태스크 큐에 넣음 + pending 상태의 프로미스 객체(P2) 반환
// 3-3. P2에 두 번째 콜백을 등록 + pending 상태의 프로미스 객체(P3) 반환
// 5-1. 이벤트 루프가 콜 스택이 비는 즉시 첫 번째 콜백을 옮겨 실행 → P2가 fulfilled 상태가 됨 → 두 번째 콜백을 큐에 넣음 → 콜 스택에서 제거
// 5-2. 콜 스택이 다시 비었으므로 바로 두 번째 콜백을 옮겨 실행 (큐가 빌 때까지 반복)
Promise.resolve('C') //
  .then(result => {
    console.log(result);
    return 'D';
  })
  .then(console.log);

console.log('E'); // 4. 콜 스택에서 실행
